; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared1 - mode
	thermograph0 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star9 - direction
	Star8 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet16)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite0 Phenomenon11)
	(pointing satellite1 Star1)
	(have_image Planet10 infrared1)
	(have_image Phenomenon11 infrared1)
	(have_image Star12 thermograph0)
	(have_image Phenomenon13 spectrograph2)
	(have_image Star14 thermograph0)
	(have_image Star15 thermograph0)
	(have_image Planet16 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation7)
   goals met: 0 of 9
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite1 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite1 planet10 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 planet10)
   goals met: 0 of 9
5. (take_image satellite1 planet10 instrument1 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon13 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon13 instrument1 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 9
9. (take_image satellite1 phenomenon11 instrument1 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon11 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 9
11. (turn_to satellite1 planet16 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet16)
   goals met: 4 of 9
12. (take_image satellite1 planet16 instrument1 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 5 of 9
13. (turn_to satellite1 star12 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star12)
   goals met: 5 of 9
14. (take_image satellite1 star12 instrument1 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 6 of 9
15. (turn_to satellite1 star14 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star14)
   goals met: 6 of 9
16. (take_image satellite1 star14 instrument1 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 7 of 9
17. (turn_to satellite1 star15 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star15)
   goals met: 7 of 9
18. (take_image satellite1 star15 instrument1 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 8 of 9
19. (turn_to satellite1 star1 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star1)
   goals met: 9 of 9
